# Combining Data In Pandas

In [22]:
import pandas as pd

In [23]:
d1 = {"Name": ["Pankaj", "Lisa"], "ID": [1, 2]}
d2 = {"Name": "David", "ID": 3}

In [24]:
d1

{'Name': ['Pankaj', 'Lisa'], 'ID': [1, 2]}

In [25]:
d2

{'Name': 'David', 'ID': 3}

In [26]:
df1 = pd.DataFrame(d1, index={1, 2})
df2 = pd.DataFrame(d2, index={3})

In [27]:
df1

     Name  ID
1  Pankaj   1
2    Lisa   2

In [28]:
df2

    Name  ID
3  David   3

## [A] Combining DataFrames Along Rows

In [29]:
df3=pd.concat([df1,df2])

In [30]:
df3

     Name  ID
1  Pankaj   1
2    Lisa   2
3   David   3

## [B] Combining DataFrames Along Columns

In [32]:
d1 = {"Name": ["Pankaj", "Lisa"], "ID": [1, 2]}
d2 = {"Role": ["Admin", "Editor"]}
df1 = pd.DataFrame(d1, index={1, 2})
df2 = pd.DataFrame(d2, index={1, 2})

In [33]:
df1

     Name  ID
1  Pankaj   1
2    Lisa   2

In [34]:
df2

     Role
1   Admin
2  Editor

In [39]:
df3=pd.concat([df1,df2],axis=1) #By default axis=0(concat by rows), axis=1(concat by cols)

In [40]:
df3

     Name  ID    Role
1  Pankaj   1   Admin
2    Lisa   2  Editor

In [41]:
df3=pd.concat([df1,df2])

In [43]:
df3  # inappropiate

     Name   ID    Role
1  Pankaj  1.0     NaN
2    Lisa  2.0     NaN
1     NaN  NaN   Admin
2     NaN  NaN  Editor

## Combining Tables : two tables with a similar structure into a single table.

In [53]:
north_america = pd.read_csv('C:/Users/PRAGYA GUPTA/OneDrive/Documents/MyProjects/PandasTutorial/csvFile/ConcatTutorial/PandasConcatenationTutorial/north_america_2000_2010.csv', index_col=0)
south_america = pd.read_csv('C:/Users/PRAGYA GUPTA/OneDrive/Documents/MyProjects/PandasTutorial/csvFile/ConcatTutorial/PandasConcatenationTutorial/south_america_2000_2010.csv', index_col=0)

In [54]:
north_america

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
Country,,,,,,,,,,,
Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0

In [55]:
south_america

         2000  2001  2002  2003  2004  2005  2006  2007  2008  2009    2010
Country
Chile    2263  2242  2250  2235  2232  2157  2165  2128  2095  2074  2069.6

In [57]:
americas = pd.concat([north_america, south_america])
americas

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
Country,,,,,,,,,,,
Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0
Chile,2263.0,2242.0,2250.0,2235.0,2232.0,2157,2165.0,2128.0,2095,2074.0,2069.6

# Joins in Pandas

In [63]:
a = pd.DataFrame({'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']})
b = pd.DataFrame({'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']})

In [64]:
a

   id val1
0   1    a
1   2    b
2  10    c
3  12    d

In [65]:
b

   id val1
0   1    p
1   2    q
2   9    r
3   8    s

In [72]:
# inner join
df = pd.merge(a, b, on='id', how='inner') 
df

   id val1_x val1_y
0   1      a      p
1   2      b      q

In [73]:
# left outer join
df = pd.merge(a, b, on='id', how='left') 
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN

In [74]:
 # right outer join
df = pd.merge(a, b, on='id', how='right')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2   9    NaN      r
3   8    NaN      s

In [75]:
# full outer join
df = pd.merge(a, b, on='id', how='outer') 
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN
4   9    NaN      r
5   8    NaN      s

In [76]:
# index join
df = pd.merge(a, b, left_index=True, right_index=True)
df

   id_x val1_x  id_y val1_y
0     1      a     1      p
1     2      b     2      q
2    10      c     9      r
3    12      d     8      s

#### ~ Pragya ðŸŽ€